{"id":106913,"xmlId":"com.idescout.sqlite","name":"SQLScout (SQLite Support)","description":"\n      First-class SQLite support for Android Studio and IntelliJ IDEA.<br><br>\n      View, manage and update SQLite databases in your Android device (<em>in real time</em>) and file system, from\n      Android Studio and IntelliJ IDEA.\n    ","tags":["Android"],"vendor":"IDEScout, Inc.","version":"7.3.0","notes":"\n      <b>Version 7.3.0</b>\n      <ul>\n        <li>Added support for Android Studio 4.1.1.</li>\n        <li>Fixed font colors in dark mode</li>\n        <li>Small bug fixes</li>\n      </ul>\n\n      <b>Version 7.2.0</b>\n      <ul>\n        <li>Added support for Android Studio 4.0.1.</li>\n        <li>Fixed issue where a foreign column referring to more than table was not recognized.</li>\n        <li>Room migration improvements:\n          <ul>\n            <li>Fixed generation of Java getters from table names where characters after first one were in uppercase.</li>\n            <li>Fixed issue where nullable primary key columns in SQLite must be non-nullable in Room.</li>\n            <li>Fixed mapping of foreign keys where a single column refers to multiple tables.</li>\n            <li>Fixed generation of arrays in Kotlin code that previously generated warnings in the editor.</li>\n          </ul>\n        </li>\n      </ul>\n\n      <b>Version 7.1.0</b>\n      <ul>\n        <li>Added support for Android Studio 4.0.0.</li>\n        <li>Various improvements and bug fixes.</li>\n      </ul>\n\n      <b>Version 7.0.0</b>\n      <ul>\n        <li>Added support for Android Studio 3.6.2.</li>\n        <li>Connecting to a SQLite database is performed asynchronously.</li>\n        <li>Added a \"Do Not Ask\" option when prompting user to pick the path of a downloaded SQLite database file.</li>\n        <li>Bug fixes.</li>\n      </ul>\n\n      <b>Version 6.2.0</b>\n      <ul>\n        <li>Added support for IntelliJ IDEA 2019.1.3 (CE and Ultimate).</li>\n      </ul>\n\n      <b>Version 6.1.1</b>\n      <ul>\n        <li>\n        <b>Database Explorer:</b> Now the actions \"Open SQL Editor\", \"Show Diagram\" and \"Reveal in File System\"\n        are disabled if the selected data source has an connection error.\n        </li>\n        <li>\n        <b>SQL Editor:</b> Fixed behavior of \"Execute SQL Statement\" actions:\n          <ul>\n            <li>\n            If the editor is an in-memory editor created from the \"Database Explorer\" view, the \"Execute SQL Statement\"\n            actions will only use the data source that was selected at the moment of the editor creation.\n            </li>\n            <li>\n            If the editor hosts a SQL file from the file system, the \"Execute SQL Statement\" actions will use the data\n            source selected in the editor's drop-down list. If the drop-down does not have a selection, SQLScout will\n            ask the user to select an existing data source or create a new one.\n            </li>\n            <li>\n            If the editor hosts a Java or Kotlin file and the SQL Statement is specified in a Room @Query annotation,\n            the \"Execute SQL Statement\" actions will use the data source currently selected in the \"Database Explorer\"\n            view. If the view does not have a selection, SQLScout will ask the user to select an existing data source or\n            create a new one.\n            </li>\n          </ul>\n        </li>\n      </ul>\n\n      <b>Version 6.1.0</b>\n      <ul>\n        <li>\n        New database connection monitor! SQLScout will monitor \"Live Device\", downloaded Android database and\n        file-system-based database connections, keeping the \"Database Explorer\" view always up-to-date.\n        </li>\n        <li>\n        The new database connection is enabled by default. It can be disabled in the IDE's \"Preferences\" dialog (on Mac)\n        or the \"Settings\" dialog (on Windows and Linux).\n        </li>\n        <li>\n        \"Live Device\" connections are now preserved in the \"Database Explorer\" view between IDE sessions.\n        </li>\n      </ul>\n\n      <b>Version 6.0.0</b>\n      <ul>\n        <li>\n        Added support for Android Studio 3.4.\n        </li>\n      </ul>\n\n      <b>Version 5.2.1</b>\n      <ul>\n        <li>\n        Now uploading database files to an Android device automatically restarts the application's default\n        <code>Activity</code>, for the application to pick up any data changes made to the uploaded file.\n        </li>\n      </ul>\n\n      <b>Version 5.2.0</b>\n      <ul>\n        <li>\n          <b>Room support improvements:</b>\n          <ul>\n            <li>Tool tip in the \"Execute SQL Statement\" editor actions now displays the name of the data source to use\n            to execute a Room query.</li>\n            <li>Fixed bug where the \"Execute SQL Statement\" editor actions did not recognize\n              <code>androidx.room</code> annotations.\n            </li>\n            <li>Fixed bug where the \"Execute SQL Statement\" editor actions did not pick up the currently selected data source\n              from the \"SQLite Explorer\" view.\n            </li>\n          </ul>\n        </li>\n        <li>\n          <b>Room migration improvements:</b>\n          <ul>\n            <li>Updated default Room version to 2.0.0 in SQLScout's settings page.</li>\n            <li>\"Room version\" text field now provides a link to Room's release notes.</li>\n            <li>Migration wizard now detects whether the user-provided Room version is correct.</li>\n            <li>Code generation now supports Room 1.x and 2.x versions.</li>\n            <li>Fixed bug in Kotlin code generation where a generated class was not found.</li>\n          </ul>\n        </li>\n      </ul>\n\n      <b>Version 5.1.0</b>\n      <ul>\n      <li>\n      Added support for opening SQLite databases Write-Ahead Logging (WAL). Please note that this fix affects\n      opening databases in the file system or downloaded from Android devices (e.g. Room databases). Opening Android\n      databases through SQLScout's \"Live Device Connection\" has <b>always</b> supported WAL.\n      </li>\n      </ul>\n\n      <b>Version 5.0.0</b>\n      <ul>\n      <li>\n      Added support for Android Studio 3.3.\n      </li>\n      <li>\n      Updated SQLite JDBC driver to version 3.25.2. This version supports Sqlite's <code>UPSERT</code> and window\n      functions. Please note that the \"Live Device Connection\" feature does <b>not</b> use SQLScout's embedded JDBC\n      driver, but the SQLite engine in the Android device instead.\n      </li>\n\n      <li>\n      <b>SQL language support improvements:</b>\n        <ul>\n        <li>\n        <code>SELECT</code> statements are allowed inside functions.\n        </li>\n        <li>\n        Added support for parsing <code>UPSERT</code> clauses (<code>UPSERT</code> was added to SQLite 3.24.0).\n        </li>\n        <li>\n        Added support for parsing window functions (window functions were added to SQLite 3.25.0).\n        </li>\n        </ul>\n      </li>\n\n      <li>\n      <b>SQL editor improvements:</b>\n        <ul>\n        <li>\n        Code completion offers binary operators when appropriate.\n        </li>\n        <li>\n        Code completion and syntax highlighting support for <code>UPSERT</code> clauses.\n        </li>\n        <li>\n        Code completion and syntax highlighting support for window functions.\n        </li>\n        </ul>\n      </li>\n      </ul>\n\n      <b>Version 4.4.2</b>\n      <ul>\n      <li>\n      Fixed usages of APIs removed in Android Studio 3.2.\n      </li>\n      <li>\n      Added support for debugging SQLite databases in Android applications built with Xamarin.\n      </li>\n      </ul>\n\n      <b>Version 4.4.1</b>\n      <ul>\n      <li>\n      Improved handling of database connection errors. When SQL Scout fails to connect to a database:\n        <ul>\n        <li>\n        The database's icon in the \"SQLite Explorer\" is decorated with a red \"X\".\n        </li>\n        <li>\n        Hovering over the database's icon in the \"SQLite Explorer\" displays the connection error message.\n        </li>\n        <li>\n        \"SQLite Explorer\" no longer attempts to reconnect to a Data Source with a failed database connection to avoid\n        spamming the \"Event Log\" with error messages.\n        </li>\n        <li>\n        The \"connection error\" message in the \"Event Log\" contains hyperlinks to:\n          <ol>\n          <li>\n          Remove the database from the \"SQLite Explorer\"\n          </li>\n          <li>\n          Select the database in the \"SQLite Explorer\"\n          </li>\n          </ol>\n        </li>\n        </ul>\n      </li>\n      </ul>\n\n      <b>Version 4.4.0</b>\n      <ul>\n      <li>\n      Added support for Android Studio 3.2 Beta 2, while keeping backwards compatibility with Android Studio 3.1.x.\n      </li>\n      <li>\n      Fixed bug where uploading database file to device failed with \"file already exists\" error.\n      </li>\n      </ul>\n\n      <b>Version 4.3.0</b>\n      <ul>\n      <li>\n      \"Live Device Connection\" now works with Samsung and non-rooted devices (this version of SQLScout requires\n      SQLScout Server 4.1 or newer.)\n      </li>\n      <li>\n      When creation of a \"Live Device\" connection fails due to a failed connection to the app, SQLScout now displays\n      a dialog suggesting that an instance of <code>SQLScoutServer</code> may be missing in the application's\n      <code>Activity</code>. The dialog includes a link to our documentation, and code samples that can be\n      copied/pasted.\n      </li>\n      </ul>\n\n      <b>Version 4.2.0</b>\n      <ul>\n      <li>If SQLScout server is not found as a dependency, SQLScout now automatically adds both\n      <code>com.idescout.sql:sqlscout-server</code> and <code>com.idescout.sql:sqlscout-server-noop</code> to\n      the application's <em>debug</em> and <em>release</em> build types, respectively.</li>\n      <li>Fixed bug where SQLScout preferences/settings were not stored in the correct location.</li>\n      <li><b>Room Migration:</b>\n        <ul>\n          <li>Version of Room to use is now a configurable preference/setting.</li>\n        </ul>\n      </li>\n      <li><b>SQL editor:</b>\n        <ul>\n          <li>Added support for <code>EXPLAIN</code> and <code>EXPLAIN QUERY PLAN</code>.</li>\n          <li>Strings now can be used as column aliases.</li>\n          <li>Functions can be used as table references in 'from' clauses.</li>\n        </ul>\n      </li>\n      </ul>\n\n      <b>Version 4.1.2</b>\n      <ul>\n      <li>When creating a \"Live Device\" connection, now SQLScout checks whether the current selected build variant\n      has SQLScout's server declared as dependency.</li>\n      </ul>\n\n      <b>Version 4.1.1</b>\n      <ul>\n      <li>Removed check where Android applications need to be launched from the IDE before connecting to a database.</li>\n      <li>Local data sources are now automatically removed if the database files they point to no longer exist.</li>\n      <li>Added additional logging to troubleshoot issues with Samsung devices.</li>\n      <li>Updated Xerial JDBC driver to version 3.21.01.</li>\n      </ul>\n\n      <b>Version 4.1.0</b>\n      <ul>\n        <li>Support for Android Studio 3.1.</li>\n        <li><b>Room Migration:</b>\n          <ul>\n            <li>Added support for nullability when generating Entity classes from a database schema:\n              <ul>\n                <li><b>Kotlin:</b> field types are marked as nullable (using the <code>?</code> keyword)</li>\n                <li><b>Java:</b> getters and setter-parameters are annotated with <code>@NonNull</code> and <code>@Nullable</code>\n                (from the package <code>android.support.annotation</code>)</li>\n              </ul>\n            </li>\n            <li>Generated code is automatically formatted.</li>\n          </ul>\n        </li>\n        <li><b>SQL editor:</b>\n          <ul>\n            <li>Added support for compound queries using the <code>UNION</code>, <code>UNION ALL</code>,\n            <code>INTERSECT</code> or <code>EXCEPT</code> operators. Support includes parsing, syntax highlighting\n            and code completion.</li>\n            <li>Fixed parsing and syntax highlighting of block comments.</li>\n          </ul>\n        </li>\n        <li>Added support for connecting to databases by opening database files (with extensions \".db\" and \".sqlite\")\n        from the file system or Android Studio's <em>Device Explorer</em> view.</li>\n      </ul>\n\n      <b>Version 4.0.0</b>\n      <ul>\n      <li>Support for database views.</li>\n      <li>Ability to save BLOBs as local files.</li>\n      <li>\"File saved\" notifications (SQL files, diagrams and BLOBs) now include a link to reveal the saved file in\n      the system's file manager.</li>\n      <li>Support for SQLScout Server 4.0.0, which replaces XML with FlatBuffers for client/server\n      communication in \"Live Device\" connections. This change fixes several bugs related to String encodings, invalid\n      XML characters present in database columns, and BLOB handling.</li>\n      <li>Added support for automatically adding SQLScout Server and the IDEScout Maven repository to build.gradle\n      files.</li>\n      <li>Fixed deadlock in IDE when attempting to create a new \"Live Device\" connection.</li>\n      <li>Fixed bug where \"Room Migration\" action was never enabled if the initial database sync failed to find\n      ADB.</li>\n      <li>Fixed bug in \"Room Migration\" where migration got interrupted when project contained Kotlin code.</li>\n      </ul>\n\n      <b>Version 3.3.1</b>\n      <ul>\n      <li>\"Room Migration\" wizard now works with projects that do not have a root module.</li>\n      <li>Database Console can now delete and update rows in tables without primary keys.</li>\n      </ul>\n\n      <b>Version 3.3.0</b>\n      <ul>\n      <li>Added support for executing SQL statements inside Room's @Query annotation.</li>\n      <li>\"Room Migration\" wizard now can handle column names that are Java or Kotlin keywords.</li>\n      <li>Added support for executing parameterized SQL statements.</li>\n      <li>Added support for expressions using 'IN' operator.</li>\n      <li>Improved code completion for subqueries.</li>\n      </ul>\n\n      <b>Version 3.2.0</b>\n      <ul>\n      <li>Added support for automated migration to Android's Room persistence library.</li>\n      </ul>\n\n      <b>Version 3.1.2</b>\n      <ul>\n      <li>Added support for Android Studio 3.0.1.</li>\n      </ul>\n\n      <b>Version 3.1.1</b>\n      <ul>\n      <li>Fixed plugin jar timestamp issue.</li>\n      </ul>\n\n      <b>Version 3.1.0</b>\n      <ul>\n      <li>Added ability to connect to any database in an Android device, from the 'Device File Explorer' view.</li>\n      <li>Now it is possible to download database files from devices using Android 7 or later.</li>\n      <li>Android database files can now be downloaded to a user-specified folder.</li>\n      <li>Better error messages for failed license validations.</li>\n      </ul>\n\n      <b>Version 3.0.0</b>\n      <ul>\n      <li>Compatible with Android Studio 3.0.0.</li>\n      <li>Port used for 'Live Database' connection is now configurable.</li>\n      <li>Improvements to SQL editor:\n        <ul>\n          <li>Added support for comments.</li>\n          <li>Improved support for subqueries.</li>\n          <li>Added support for 'between' operator.</li>\n          <li>Added support for 'when' operator.</li>\n        </ul>\n      </li>\n      </ul>\n\n      <b>Version 2.0.8</b>\n      <ul>\n      <li>Compatible with Android Studio 2.3.0.</li>\n      <li>Bug fixes.</li>\n      </ul>\n\n      <b>Version 2.0.7</b>\n      <ul>\n      <li>Bug fixes.</li>\n      </ul>\n\n      <b>Version 2.0.6</b>\n      <ul>\n      <li>Support for Android 7 (Nougat.)</li>\n      <li>Now 'Live Device Connection' can handle large tables (e.g. 20,000 records.)</li>\n      <li>Fixed handling of null values.</li>\n      <li>Bug fixes.</li>\n      </ul>\n\n      <b>Version 2.0.5</b>\n      <ul>\n      <li>Compatible with Android Studio 2.2.0.</li>\n      <li>Bug fixes.</li>\n      </ul>\n\n      <b>Version 2.0.4</b>\n      <ul>\n      <li>Unified \"trial\" and \"registered\" versions. Users no longer need to download 2 versions of the plugin.</li>\n      </ul>\n\n      <b>Version 2.0.3</b>\n      <ul>\n      <li>Fixed license number check.</li>\n      </ul>\n\n      <b>Version 2.0.2</b>\n      <ul>\n      <li>Minor bug fixes.</li>\n      </ul>\n\n      <b>Version 2.0.1</b>\n      <ul>\n      <li>Fixed assertion error thrown when querying an empty table from the 'SQLite Explorer'.</li>\n      </ul>\n\n      <b>Version 2.0.0</b>\n      <ul>\n      <li>Added ability to manage and update databases in Android devices, <em>in real time</em>.</li>\n      <li>Editor gutter now displays an \"Execute Statement\" action next to each SQL statement.</li>\n      <li>Bug fixes.</li>\n      </ul>\n  ","dependencies":["org.jetbrains.android","org.jetbrains.plugins.gradle","com.intellij.properties","org.jetbrains.kotlin","com.intellij.modules.java","com.intellij.java"],"since":"201.0","until":"211","size":16013651}